tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
bool readInt64Param(const char* name, int64_t& out) {
  char raw[24];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  char* end = nullptr;
  const long long value = strtoll(raw, &end, 10);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<int64_t>(value);
  return true;
}

bool hasParam(const char* name) {
  return Esp32BaseWeb::hasParam(name);
}

bool readInt64ParamOptional(const char* name, int64_t& out) {
  char raw[24];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return true;
  }
  char* end = nullptr;
  const long long value = strtoll(raw, &end, 10);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<int64_t>(value);
  return true;
}

bool readUint32Param(const char* name, uint32_t& out) {
  char raw[16];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  char* end = nullptr;
  const unsigned long value = strtoul(raw, &end, 10);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<uint32_t>(value);
  return true;
}

bool readUint32ParamOptional(const char* name, uint32_t& out) {
  return !Esp32BaseWeb::hasParam(name) || readUint32Param(name, out);
}

struct PageParams {
  uint32_t page = 1;
  uint32_t per = 15;
};

bool readPageParams(uint32_t defaultPer, uint32_t maxPer, PageParams& out) {
  PageParams params;
  params.per = defaultPer;
  if (!readUint32ParamOptional("page", params.page) ||
      !readUint32ParamOptional("per", params.per) || params.page == 0 || params.per == 0) {
    return false;
  }
  if (params.per > maxPer) {
    params.per = maxPer;
  }
  out = params;
  return true;
}

bool pageStartIndex(const PageParams& params, uint32_t& out) {
  if (params.page == 0 || params.per == 0) {
    return false;
  }
  const uint32_t pageOffset = params.page - 1;
  if (pageOffset > UINT32_MAX / params.per) {
    return false;
  }
  out = pageOffset * params.per;
  return true;
}

void sendUint32Text(uint32_t value) {
  char text[16];
  snprintf(text, sizeof(text), "%lu", static_cast<unsigned long>(value));
  Esp32BaseWeb::sendChunk(text);
}

void sendInt64Text(int64_t value) {
  char text[24];
  snprintf(text, sizeof(text), "%lld", static_cast<long long>(value));
  Esp32BaseWeb::sendChunk(text);
}

void sendTimeText(uint32_t unixTime, uint32_t uptimeSec) {
  if (unixTime > 0) {
    Esp32BaseWeb::sendChunk("Unix ");
    sendUint32Text(unixTime);
    return;
  }
  Esp32BaseWeb::sendChunk("启动 +");
  sendUint32Text(uptimeSec);
  Esp32BaseWeb::sendChunk(" 秒");
}

void sendRecordPulseRange(int64_t oldValue, int64_t newValue) {
  sendInt64Text(oldValue);
  Esp32BaseWeb::sendChunk(" -> ");
  sendInt64Text(newValue);
}

void sendRecordDelta(int64_t oldValue, int64_t newValue, int64_t deltaValue) {
  sendRecordPulseRange(oldValue, newValue);
  Esp32BaseWeb::sendChunk(" (");
  if (deltaValue > 0) {
    Esp32BaseWeb::sendChunk("+");
  }
  sendInt64Text(deltaValue);
  Esp32BaseWeb::sendChunk(")");
}

void sendPlainRow(const char* label, const char* value, const char* detail = nullptr) {
  Esp32BaseWeb::sendChunk("<tr><td class='muted'>");
  Esp32BaseWeb::writeHtmlEscaped(label ? label : "");
  Esp32BaseWeb::sendChunk("</td><td>");
  Esp32BaseWeb::writeHtmlEscaped(value ? value : "");
  if (detail != nullptr && detail[0] != '\0') {
    Esp32BaseWeb::sendChunk("<small>");
    Esp32BaseWeb::writeHtmlEscaped(detail);
    Esp32BaseWeb::sendChunk("</small>");
  }
  Esp32BaseWeb::sendChunk("</td></tr>");
}

void sendStatusMetric(const char* label, const char* value, const char* detail = nullptr) {
  Esp32BaseWeb::sendChunk("<span><b>");
  Esp32BaseWeb::writeHtmlEscaped(label ? label : "");
  Esp32BaseWeb::sendChunk("</b><em>");
  Esp32BaseWeb::writeHtmlEscaped(value ? value : "");
  Esp32BaseWeb::sendChunk("</em>");
  if (detail != nullptr && detail[0] != '\0') {
    Esp32BaseWeb::sendChunk("<small class='muted'>");
    Esp32BaseWeb::writeHtmlEscaped(detail);
    Esp32BaseWeb::sendChunk("</small>");
  }
  Esp32BaseWeb::sendChunk("</span>");
}

void beginStatusMetrics() {
  Esp32BaseWeb::sendChunk("<div class='submetrics'>");
}

void endStatusMetrics() {
  Esp32BaseWeb::sendChunk("</div>");
}

void beginPlainTable() {
  Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'>");
}

void endPlainTable() {
  Esp32BaseWeb::sendChunk("</table></div>");
}

void sendDoorStatusTable(const DoorSnapshot& snapshot,
                         const char* positionValue,
                         const char* targetValue,
                         const char* percentValue,
                         const char* maxRunValue) {
  char stateDetail[48];
  snprintf(stateDetail, sizeof(stateDetail), "当前命令：%s", commandName(snapshot.activeCommand));
  char positionDetail[48];
  snprintf(positionDetail, sizeof(positionDetail), "可信度：%s", trustName(snapshot.positionTrustLevel));
  char targetDetail[48];
  snprintf(targetDetail, sizeof(targetDetail), "保护边界：%s", maxRunValue);

  beginStatusMetrics();
  sendStatusMetric("门状态", stateName(snapshot.state), stateDetail);
  sendStatusMetric("门位判断", percentValue, positionDetail);
  sendStatusMetric("当前位置", positionValue, "编码器累计位置");
  sendStatusMetric("开门目标", targetValue, targetDetail);
  sendStatusMetric("最近停止", stopReasonName(snapshot.lastStopReason), "用于判断上次停止是否正常");
  sendStatusMetric("电机", g_motorOutputReady ? "已就绪" : "未就绪",
                   g_motorOutputReady ? "命令将直接输出" : "初始化失败时会拒绝动作");
  sendStatusMetric("故障", faultReasonName(snapshot.faultReason),
                   snapshot.faultReason == DoorFaultReason::None ? "当前无业务故障" : "需要处理后再运行");
  endStatusMetrics();
}

void sendDoorActionButtons(const DoorSnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("<div class='actions'>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/door/open' onsubmit='return once(this)'><input class='btnlink ok' type='submit' value='开门'></form>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/door/close' onsubmit='return once(this)'><input class='btnlink info' type='submit' value='关门'></form>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/door/stop' onsubmit='return once(this)'><input class='btnlink danger' type='submit' value='停止'></form>");
  if (snapshot.state == DoorState::Fault || snapshot.faultReason != DoorFaultReason::None) {
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/maintenance/clear-fault' onsubmit=\"return confirm('清除当前故障？')&&once(this)\"><input class='btnlink danger' type='submit' value='清除故障'></form>");
  }
  Esp32BaseWeb::sendChunk("</div>");
}

void sendCalibrationStatusTable(const DoorSnapshot& snapshot,
                                const char* positionValue,
                                const char* targetValue,
                                const char* turnsValue,
                                const char* pulsesPerRevValue) {
  beginStatusMetrics();
  sendStatusMetric("当前位置", positionValue, trustName(snapshot.positionTrustLevel));
  sendStatusMetric("开门目标", targetValue, turnsValue);
  sendStatusMetric("每圈信号数", pulsesPerRevValue, "output pulses/rev");
  sendStatusMetric("最近停止", stopReasonName(snapshot.lastStopReason), "校准后建议确认停止原因");
  endStatusMetrics();
}

void sendCalibrationActionForm(const char* title,
                               const char* detail,
                               const char* action,
                               const char* confirmText,
                               const char* hiddenName,
                               const char* hiddenValue,
                               const char* submitValue,
                               const char* toneClass) {
  Esp32BaseWeb::sendChunk("<div class='urow'><div><b>");
  Esp32BaseWeb::writeHtmlEscaped(title ? title : "");
  Esp32BaseWeb::sendChunk("</b>");
  if (detail != nullptr && detail[0] != '\0') {
    Esp32BaseWeb::sendChunk("<small>");
    Esp32BaseWeb::writeHtmlEscaped(detail);
    Esp32BaseWeb::sendChunk("</small>");
  }
  Esp32BaseWeb::sendChunk("</div><div class='uactions'><span class='uvalue'></span><form method='post' action='");
  Esp32BaseWeb::writeHtmlEscaped(action ? action : "");
  Esp32BaseWeb::sendChunk("' onsubmit=\"return confirm('");
  Esp32BaseWeb::writeHtmlEscaped(confirmText ? confirmText : "");
  Esp32BaseWeb::sendChunk("')&&once(this)\"><input type='hidden' name='");
  Esp32BaseWeb::writeHtmlEscaped(hiddenName ? hiddenName : "");
  Esp32BaseWeb::sendChunk("' value='");
  Esp32BaseWeb::writeHtmlEscaped(hiddenValue ? hiddenValue : "");
  Esp32BaseWeb::sendChunk("'><input class='btnlink ");
  Esp32BaseWeb::writeHtmlEscaped(toneClass ? toneClass : "warn");
  Esp32BaseWeb::sendChunk("' type='submit' value='");
  Esp32BaseWeb::writeHtmlEscaped(submitValue ? submitValue : "");
  Esp32BaseWeb::sendChunk("'></form></div></div>");
}

void sendDiagnosticsStatusTable(const FarmDoorReadOnlyDiagnostics& diagnostics,
                                const char* at24cValue,
                                const char* currentValue) {
  char currentDetail[80];
  snprintf(currentDetail,
           sizeof(currentDetail),
           "min=%d max=%d avg=%d samples=%u",
           diagnostics.currentRawMin,
           diagnostics.currentRawMax,
           diagnostics.currentRawAvg,
           diagnostics.currentSampleCount);
  char buttonValue[48];
  snprintf(buttonValue,
           sizeof(buttonValue),
           "开:%u 关:%u 停:%u 辅:%u",
           diagnostics.buttonOpen,
           diagnostics.buttonClose,
           diagnostics.buttonStop,
           diagnostics.buttonAux);
  char encoderValue[32];
  snprintf(encoderValue, sizeof(encoderValue), "A:%u B:%u", diagnostics.encoderA, diagnostics.encoderB);
  beginStatusMetrics();
  sendStatusMetric("AT24C128", at24cValue, g_at24cStoreReady ? "记录存储已就绪" : "记录存储未就绪");
  sendStatusMetric("电流采样", currentValue, currentDetail);
  sendStatusMetric("电流保护", g_currentGuard.enabled ? "已启用" : "未启用",
                   ina240CompileEnabled() ? "固件已包含 INA240A2 支持" : "固件未启用 INA240A2");
  sendStatusMetric("电机", g_motorOutputReady ? "已就绪" : "未就绪",
                   g_motorOutputReady ? "驱动和编码器初始化成功" : "动作命令会返回错误");
  sendStatusMetric("按钮输入", buttonValue, "1 表示高电平，0 表示低电平");
  sendStatusMetric("编码器输入", encoderValue, "只读 GPIO 当前电平");
  endStatusMetrics();
}

int64_t openTargetPulsesFromTurnsX100(int64_t turnsX100) {
  return (kDefaultOutputPulsesPerRev * turnsX100) / 100;
}

int64_t turnsX100FromOpenTargetPulses(int64_t openTargetPulses) {
  return (openTargetPulses * 100) / kDefaultOutputPulsesPerRev;
}

int64_t defaultMaxRunPulsesForTarget(int64_t openTargetPulses) {
  return (openTargetPulses * 150) / 100;
}

