tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
bool readTrustLevelParam(PositionTrustLevel& out) {
  char raw[16];
  if (!Esp32BaseWeb::getParam("trustLevel", raw, sizeof(raw))) {
    out = PositionTrustLevel::Trusted;
    return true;
  }
  if (strcmp(raw, "Trusted") == 0 || strcmp(raw, "trusted") == 0) {
    out = PositionTrustLevel::Trusted;
    return true;
  }
  if (strcmp(raw, "Limited") == 0 || strcmp(raw, "limited") == 0) {
    out = PositionTrustLevel::Limited;
    return true;
  }
  if (strcmp(raw, "Untrusted") == 0 || strcmp(raw, "untrusted") == 0) {
    out = PositionTrustLevel::Untrusted;
    return true;
  }
  return false;
}

void applyRuntimeConfigFromBase() {
#if ESP32BASE_ENABLE_APP_CONFIG
  const int32_t speedPercent = Esp32BaseConfig::getInt("door", "speed", 60);
  const int32_t openTurnsX100 = Esp32BaseConfig::getInt("door", "openTurns", 500);
  const int32_t legacyMaxRunMs = Esp32BaseConfig::getInt("door", "maxRunMs", 25000);
  const int32_t defaultMaxRunSec = legacyMaxRunMs > 0 ? (legacyMaxRunMs + 999) / 1000 : 25;
  const int32_t maxRunSec = Esp32BaseConfig::getInt("door", "maxRunSec", defaultMaxRunSec);
  const bool requestedCurrentGuard =
      Esp32BaseConfig::getBool("door", "currentGuard", false);

  if (speedPercent >= 10 && speedPercent <= 100) {
    g_motorProfile.speedPercent = static_cast<uint8_t>(speedPercent);
  }
  if (openTurnsX100 > 0) {
    g_doorConfig.openTargetPulses = openTargetPulsesFromTurnsX100(openTurnsX100);
    g_doorConfig.maxRunPulses = defaultMaxRunPulsesForTarget(g_doorConfig.openTargetPulses);
    g_motorProtection.maxRunPulses = g_doorConfig.maxRunPulses;
  }
  if (maxRunSec > 0) {
    g_doorConfig.maxRunMs = static_cast<uint32_t>(maxRunSec) * 1000UL;
    g_motorProtection.maxRunMs = g_doorConfig.maxRunMs;
  }
  const DoorSnapshot snapshot = g_door.snapshot();
  if (snapshot.state != DoorState::Opening && snapshot.state != DoorState::Closing) {
    g_door.configure(g_doorConfig);
  }
  if (g_motorOutputReady) {
    g_motor.configure(g_motorKinematics, g_motorProfile, g_motorProtection, g_motorStopPolicy);
  }
  g_currentGuard.enabled = ina240CompileEnabled() && requestedCurrentGuard;
#else
  g_currentGuard.enabled = false;
#endif
}

bool configureDoorMotor() {
  if (g_motorOutputReady) {
    return true;
  }
  Esp32EncodedDcMotor::MotorResult result = g_motorEncoder.begin(g_encoderBackend);
  if (result != Esp32EncodedDcMotor::MotorResult::Ok) {
    ESP32BASE_LOG_E("farmdoor", "motor_encoder_begin_failed result=%u",
                    static_cast<unsigned>(result));
    FarmAutoEventLog::recordStorageWarning("door_motor", "encoder_begin_failed",
                                           static_cast<uint16_t>(result));
    return false;
  }
  g_motorEncoder.resetPosition(g_door.snapshot().positionPulses);
  result = g_motorDriver.begin(FarmDoorHw.pins().motorIn1, FarmDoorHw.pins().motorIn2,
                               g_motorHardware);
  if (result != Esp32EncodedDcMotor::MotorResult::Ok) {
    ESP32BASE_LOG_E("farmdoor", "motor_driver_begin_failed result=%u",
                    static_cast<unsigned>(result));
    FarmAutoEventLog::recordStorageWarning("door_motor", "driver_begin_failed",
                                           static_cast<uint16_t>(result));
    return false;
  }
  result = g_motor.begin(g_motorDriver, g_motorEncoder, g_motorHardware, g_encoderBackend);
  if (result == Esp32EncodedDcMotor::MotorResult::Ok) {
    result = g_motor.configure(g_motorKinematics, g_motorProfile, g_motorProtection,
                               g_motorStopPolicy);
  }
  if (result != Esp32EncodedDcMotor::MotorResult::Ok) {
    ESP32BASE_LOG_E("farmdoor", "motor_begin_failed result=%u", static_cast<unsigned>(result));
    FarmAutoEventLog::recordStorageWarning("door_motor", "motor_begin_failed",
                                           static_cast<uint16_t>(result));
    return false;
  }
  g_motorOutputReady = true;
  return true;
}

DoorCommandResult startDoorMotorTo(int64_t targetPulses) {
  if (!configureDoorMotor()) {
    return DoorCommandResult::InvalidArgument;
  }
  const Esp32EncodedDcMotor::MotorResult result = g_motor.requestMoveToPosition(targetPulses);
  if (result == Esp32EncodedDcMotor::MotorResult::Ok) {
    return DoorCommandResult::Ok;
  }
  ESP32BASE_LOG_W("farmdoor", "motor_start_failed result=%u", static_cast<unsigned>(result));
  g_door.enterFault(DoorFaultReason::MotorFault);
  FarmAutoEventLog::recordDoorProtectionStopped("motor_start_failed", g_door.snapshot().positionPulses);
  return DoorCommandResult::FaultActive;
}

void sendMotorOutputJson() {
  Esp32BaseWeb::sendChunk("\"motorRuntime\":{\"ready\":");
  Esp32BaseWeb::sendChunk(boolJson(g_motorOutputReady));
  if (g_motorOutputReady) {
    const Esp32EncodedDcMotor::MotorSnapshot motor = g_motor.snapshot();
    Esp32BaseWeb::sendChunk(",\"positionPulses\":");
    sendInt64(motor.positionPulses);
    Esp32BaseWeb::sendChunk(",\"targetPulses\":");
    sendInt64(motor.targetPulses);
    Esp32BaseWeb::sendChunk(",\"outputPercent\":");
    sendUint32(motor.driverOutputPercent);
    Esp32BaseWeb::sendChunk(",\"faultReason\":");
    sendUint32(static_cast<uint32_t>(motor.faultReason));
  }
  Esp32BaseWeb::sendChunk("}");
}

void updateDoorMotorRuntime() {
  if (!g_motorOutputReady) {
    return;
  }
  g_motor.update(millis());
  const DoorSnapshot door = g_door.snapshot();
  if (door.state != DoorState::Opening && door.state != DoorState::Closing) {
    return;
  }
  const Esp32EncodedDcMotor::MotorSnapshot motor = g_motor.snapshot();
  if (motor.state == Esp32EncodedDcMotor::MotorState::Idle) {
    if (g_door.onMotionTargetReached(motor.positionPulses) == DoorCommandResult::Ok) {
      persistDoorRecoveryStateIfReady();
    }
    return;
  }
  if (motor.state == Esp32EncodedDcMotor::MotorState::Fault) {
    g_door.enterFault(DoorFaultReason::MotorFault);
    FarmAutoEventLog::recordDoorProtectionStopped("motor_fault", motor.positionPulses);
    persistDoorRecoveryStateIfReady();
  }
}

DoorRecordTime currentRecordTime() {
  DoorRecordTime time;
#if ESP32BASE_ENABLE_NTP
  const Esp32BaseNtp::TimeSnapshot snapshot = Esp32BaseNtp::snapshot();
  time.unixTime = snapshot.synced ? snapshot.epochSec : 0;
  time.uptimeSec = snapshot.uptimeSec;
  time.bootId = snapshot.bootId;
#endif
  return time;
}

#if ESP32BASE_ENABLE_FS
bool appendDoorRecordBytes(const char* path, const uint8_t* data, std::size_t length, void*) {
  return Esp32BaseFs::appendBytes(path, data, length);
}

