tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
struct BusinessEventTableState {
  uint16_t emitted = 0;
};

void sendBusinessEventHtmlRow(const FarmAutoEventLog::BusinessEvent& event) {
  Esp32BaseWeb::sendChunk("<tr><td>");
  sendUint32Text(event.id);
  Esp32BaseWeb::sendChunk("</td><td>");
  sendTimeText(event.timeSynced ? event.epochSec : 0, event.uptimeSec);
  Esp32BaseWeb::sendChunk("</td><td>");
  Esp32BaseWeb::writeHtmlEscaped(appEventLevelName(event.level));
  Esp32BaseWeb::sendChunk("</td><td>");
  Esp32BaseWeb::writeHtmlEscaped(event.domain);
  Esp32BaseWeb::sendChunk("</td><td>");
  Esp32BaseWeb::writeHtmlEscaped(event.action);
  Esp32BaseWeb::sendChunk("</td><td>");
  Esp32BaseWeb::writeHtmlEscaped(event.target);
  Esp32BaseWeb::sendChunk("</td><td>");
  Esp32BaseWeb::writeHtmlEscaped(event.message);
  Esp32BaseWeb::sendChunk("</td><td>");
  Esp32BaseWeb::writeHtmlEscaped(event.detail);
  Esp32BaseWeb::sendChunk("</td></tr>");
}

void sendBusinessEventHtmlCallback(const FarmAutoEventLog::BusinessEvent& event, void* user) {
  BusinessEventTableState* state = static_cast<BusinessEventTableState*>(user);
  if (state == nullptr) {
    return;
  }
  sendBusinessEventHtmlRow(event);
  ++state->emitted;
}

void sendRecentCommandJson() {
  const DoorRecordSnapshot records = g_records.snapshot();
  for (uint8_t i = records.count; i > 0; --i) {
    const DoorRecord& record = records.records[i - 1];
    if (record.commandId == 0) {
      continue;
    }
    Esp32BaseWeb::sendChunk("{\"commandId\":");
    sendUint32(record.commandId);
    Esp32BaseWeb::sendChunk(",\"sequence\":");
    sendUint32(record.sequence);
    Esp32BaseWeb::sendChunk(",\"unixTime\":");
    sendUint32(record.unixTime);
    Esp32BaseWeb::sendChunk(",\"eventType\":\"");
    Esp32BaseWeb::sendChunk(recordTypeName(record.type));
    Esp32BaseWeb::sendChunk("\",\"command\":\"");
    Esp32BaseWeb::sendChunk(commandName(record.command));
    Esp32BaseWeb::sendChunk("\",\"result\":\"");
    Esp32BaseWeb::sendChunk(recordResultName(record.result));
    Esp32BaseWeb::sendChunk("\"}");
    return;
  }
  Esp32BaseWeb::sendChunk("null");
}

void sendCommandResultJson(DoorCommandResult result, uint32_t commandId = 0) {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  beginRawJson(httpCodeFor(result));
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(commandResultName(result));
  Esp32BaseWeb::sendChunk("\",\"commandId\":");
  sendUint32(commandId);
  Esp32BaseWeb::sendChunk(",\"state\":\"");
  Esp32BaseWeb::sendChunk(stateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"activeCommand\":\"");
  Esp32BaseWeb::sendChunk(commandName(snapshot.activeCommand));
  Esp32BaseWeb::sendChunk("\",\"positionPulses\":");
  sendInt64(snapshot.positionPulses);
  Esp32BaseWeb::sendChunk(",\"targetPulses\":");
  sendInt64(snapshot.targetPulses);
  Esp32BaseWeb::sendChunk(",");
  sendMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void sendTravelResultJson(DoorCommandResult result, bool configSaved, uint32_t commandId = 0) {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  beginRawJson(httpCodeFor(result));
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(commandResultName(result));
  Esp32BaseWeb::sendChunk("\",\"commandId\":");
  sendUint32(commandId);
  Esp32BaseWeb::sendChunk(",\"state\":\"");
  Esp32BaseWeb::sendChunk(stateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"openTargetPulses\":");
  sendInt64(snapshot.openTargetPulses);
  Esp32BaseWeb::sendChunk(",\"openTurnsX100\":");
  sendInt64(turnsX100FromOpenTargetPulses(snapshot.openTargetPulses));
  Esp32BaseWeb::sendChunk(",\"maxRunPulses\":");
  sendInt64(g_doorConfig.maxRunPulses);
  Esp32BaseWeb::sendChunk(",\"configSaved\":");
  Esp32BaseWeb::sendChunk(configSaved ? "true" : "false");
  Esp32BaseWeb::sendChunk(",");
  sendMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

DoorCommandResult applyTravelUpdate(int64_t openTargetPulses,
                                    int64_t maxRunPulses,
                                    bool& configSaved) {
  configSaved = false;
  if (openTargetPulses <= g_doorConfig.closedPositionPulses || maxRunPulses <= 0) {
    return DoorCommandResult::InvalidArgument;
  }

  const DoorControllerConfig oldDoorConfig = g_doorConfig;
  const int64_t oldProtectionMaxRunPulses = g_motorProtection.maxRunPulses;
  g_doorConfig.openTargetPulses = openTargetPulses;
  g_doorConfig.maxRunPulses = maxRunPulses;
  g_motorProtection.maxRunPulses = maxRunPulses;

  const DoorCommandResult result = g_door.updateTravel(openTargetPulses, maxRunPulses);
  if (result != DoorCommandResult::Ok) {
    g_doorConfig = oldDoorConfig;
    g_motorProtection.maxRunPulses = oldProtectionMaxRunPulses;
    return result;
  }

#if ESP32BASE_ENABLE_APP_CONFIG
  const int64_t turnsX100 = turnsX100FromOpenTargetPulses(openTargetPulses);
  if (turnsX100 > 0 && turnsX100 <= 2000) {
    configSaved = Esp32BaseConfig::setInt("door", "openTurns", static_cast<int32_t>(turnsX100));
  }
#endif
  return result;
}

#if ESP32BASE_ENABLE_APP_CONFIG
void onAppConfigChange(const Esp32BaseAppConfig::Change& change) {
  if (change.field.ns && change.field.key && strcmp(change.field.ns, "door") == 0) {
    applyRuntimeConfigFromBase();
    if (g_motorOutputReady) {
      g_motor.configure(g_motorKinematics, g_motorProfile, g_motorProtection, g_motorStopPolicy);
    }
    ESP32BASE_LOG_I("farmdoor", "runtime_config_changed key=%s current_guard_enabled=%s",
                    change.field.key,
                    g_currentGuard.enabled ? "yes" : "no");
  }
}
#endif

void applyRecoveredDoorConfig(const DoorRecoveryState& state) {
  g_doorConfig.closedPositionPulses = state.closedPositionPulses;
  g_doorConfig.openTargetPulses = state.openTargetPulses;
  g_doorConfig.maxRunPulses = state.maxRunPulses;
  g_doorConfig.maxRunMs = state.maxRunMs;
  g_motorProtection.maxRunPulses = state.maxRunPulses;
  g_motorProtection.maxRunMs = state.maxRunMs;
}

