tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
void initializeDoorAt24cStore() {
  const Esp32At24cRecordStore::Result beginResult =
      g_at24cStore.begin(g_at24cDevice, kDoorAt24cConfig, kDoorAt24cRegions, kDoorAt24cRegionCount);
  if (beginResult != Esp32At24cRecordStore::Result::Ok) {
    ESP32BASE_LOG_W("farmdoor", "at24c_store_begin_failed result=%u",
                    static_cast<unsigned>(beginResult));
    return;
  }
  g_at24cStoreReady = true;

  DoorRecoveryState recovered;
  const Esp32At24cRecordStore::Result loadResult = loadDoorRecoveryState(g_at24cStore, recovered);
  if (loadResult == Esp32At24cRecordStore::Result::Ok) {
    const DoorCommandResult applyResult = applyDoorRecoveryState(g_door, recovered);
    if (applyResult == DoorCommandResult::Ok) {
      applyRecoveredDoorConfig(recovered);
      ESP32BASE_LOG_I("farmdoor", "door_recovery_restored position=%lld target=%lld",
                      static_cast<long long>(recovered.positionPulses),
                      static_cast<long long>(recovered.openTargetPulses));
    } else {
      ESP32BASE_LOG_W("farmdoor", "door_recovery_apply_failed result=%u",
                      static_cast<unsigned>(applyResult));
    }
    return;
  }
  if (loadResult != Esp32At24cRecordStore::Result::FormatRequired) {
    ESP32BASE_LOG_W("farmdoor", "door_recovery_load_failed result=%u",
                    static_cast<unsigned>(loadResult));
  }
}

bool persistDoorRecoveryStateIfReady() {
  if (!g_at24cStoreReady) {
    return false;
  }
  const DoorRecordTime time = currentRecordTime();
  const DoorRecoveryState state = doorRecoveryStateFromSnapshot(
      g_door.snapshot(), g_doorConfig, time.unixTime, time.uptimeSec, time.bootId);
  const Esp32At24cRecordStore::Result result = saveDoorRecoveryState(g_at24cStore, state);
  if (result == Esp32At24cRecordStore::Result::Ok ||
      result == Esp32At24cRecordStore::Result::Unchanged) {
    return true;
  }
  ESP32BASE_LOG_W("farmdoor", "door_recovery_save_failed result=%u",
                  static_cast<unsigned>(result));
  return false;
}

}  // namespace

FarmDoorApp FarmDoor;

void FarmDoorApp::begin() {
  Serial.begin(115200);
  configureStaticDefaults();
  configureHardwareInputs();

  Esp32Base::setFirmwareInfo("Esp32FarmDoor", "0.1.0");
  configureAppConfigPage();
  configureBusinessShell();

  if (!Esp32Base::begin()) {
    ESP32BASE_LOG_E("farmdoor", "Esp32Base begin failed: %s", Esp32Base::lastError());
  } else {
    initializeDoorAt24cStore();
    applyRuntimeConfigFromBase();
    configureDoorMotor();
    ESP32BASE_LOG_I("farmdoor", "skeleton ready, ina240a2_gpio=%u enabled=%s",
                    FarmDoorHw.pins().currentAdc,
                    g_currentGuard.enabled ? "yes" : "no");
  }
}

void FarmDoorApp::handle() {
  Esp32Base::handle();
  updateDoorMotorRuntime();
}

void FarmDoorApp::configureHardwareInputs() {
  FarmDoorHw.begin(FarmDoorHardwarePins{});
}

void FarmDoorApp::configureStaticDefaults() {
  g_motorHardware.driverType = Esp32EncodedDcMotor::DriverType::At8236HBridge;
  g_motorHardware.pwmFrequencyHz = 20000;
  g_motorHardware.pwmResolutionBits = 8;
  g_motorHardware.ledcChannelA = 0;
  g_motorHardware.ledcChannelB = 1;

  g_encoderBackend.backendType = Esp32EncodedDcMotor::EncoderBackendType::Pcnt;
  g_encoderBackend.pinA = FarmDoorHw.pins().encoderA;
  g_encoderBackend.pinB = FarmDoorHw.pins().encoderB;
  g_encoderBackend.countMode = Esp32EncodedDcMotor::CountMode::X1;
  g_encoderBackend.pcntUnit = 0;
  g_encoderBackend.glitchFilterNs = 1000;

  g_motorKinematics.motorShaftPulsesPerRev = 16;
  g_motorKinematics.gearRatio = 131.0f;
  g_motorKinematics.outputPulsesPerRev = kDefaultOutputPulsesPerRev;
  g_motorKinematics.countMode = Esp32EncodedDcMotor::CountMode::X1;

  g_motorProfile.speedPercent = 60;
  g_motorProfile.softStartMs = 1000;
  g_motorProfile.softStopMs = 500;
  g_motorProfile.minEffectiveSpeedPercent = 15;

  g_motorProtection.startupGraceMs = 1000;
  g_motorProtection.maxRunMs = 25000;
  g_motorProtection.maxRunPulses = kDefaultMaxRunPulses;

  g_motorStopPolicy.emergencyOutputMode = Esp32EncodedDcMotor::EmergencyOutputMode::Coast;

  g_currentSensor.adcPin = FarmDoorHw.pins().currentAdc;
  g_currentSensor.amplifierGain = 50.0f;
  g_currentSensor.senseResistorMilliOhm = 5.0f;
  g_currentSensor.bidirectional = true;

#if FARMAUTO_FARMDOOR_ENABLE_INA240A2
  g_currentGuard.enabled = false;  // 软件支持已接入；实测校准前默认不启用保护动作。
#else
  g_currentGuard.enabled = false;
#endif
  g_currentGuard.warningThresholdMa = 1800;
  g_currentGuard.faultThresholdMa = 2500;
  g_currentGuard.startupGraceMs = 1000;

  g_recordStoreConfig.layoutVersion = 1;
  g_recordStoreConfig.baseAddress = 0;
  g_recordStoreConfig.totalBytes = 16 * 1024;
  g_recordStoreConfig.pageSize = 64;

  g_doorConfig.closedPositionPulses = 0;
  g_doorConfig.openTargetPulses = kDefaultOpenTargetPulses;
  g_doorConfig.maxRunPulses = kDefaultMaxRunPulses;
  g_doorConfig.maxRunMs = g_motorProtection.maxRunMs;
  const DoorCommandResult doorConfigResult = g_door.configure(g_doorConfig);
  if (doorConfigResult != DoorCommandResult::Ok) {
    ESP32BASE_LOG_E("farmdoor", "door_config_failed result=%u", static_cast<unsigned>(doorConfigResult));
  }
}

void FarmDoorApp::configureAppConfigPage() {
#if ESP32BASE_ENABLE_APP_CONFIG
  Esp32BaseAppConfig::setTitle("Esp32FarmDoor 参数");
  Esp32BaseAppConfig::setChangeCallback(onAppConfigChange);
  Esp32BaseAppConfig::addGroup({"motor", "电机"});
  Esp32BaseAppConfig::addGroup({"protection", "保护"});
  Esp32BaseAppConfig::addGroup({"current", "电流检测"});

  Esp32BaseAppConfig::addInt({"motor", "door", "speed", "运行速度", 60, 10, 100, 5, "%",
                              "普通开门/关门速度。", false, nullptr});
  Esp32BaseAppConfig::addDecimal({"motor", "door", "openTurns", "开门目标", 500, 0, 2000, 5, 2,
                                  "圈", "开门目标圈数，可由校准流程更新。", false, nullptr});
  Esp32BaseAppConfig::addInt({"protection", "door", "maxRunSec", "最大保护运行时长", 25, 1,
                              120, 1, "秒", "保底停止边界。", false, nullptr});
  Esp32BaseAppConfig::addBool({"current", "door", "currentGuard", "启用 INA240A2", false,
                               "GPIO33 电流检测，实测稳定后启用。", false, nullptr});
#endif
}

