tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
void FarmDoorApp::configureBusinessShell() {
#if ESP32BASE_ENABLE_WEB
  Esp32BaseWeb::setDeviceName("自动门");
  Esp32BaseWeb::setHomePath("/index");
  Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_APP);
  Esp32BaseWeb::setSystemNavMode(Esp32BaseWeb::SYSTEM_NAV_SECTION);
  Esp32BaseWeb::addNavItem("/index", "首页");
  Esp32BaseWeb::addNavItem("/records", "开关门记录");
  Esp32BaseWeb::addNavItem("/events", "业务事件");
  Esp32BaseWeb::addNavItem("/calibration", "校准");
  Esp32BaseWeb::addNavItem("/diagnostics", "诊断");
  Esp32BaseWeb::addPage("/index", "自动门首页", FarmDoorApp::sendHomePage);
  Esp32BaseWeb::addPage("/records", "自动门记录", FarmDoorApp::sendRecordsPage);
  Esp32BaseWeb::addPage("/events", "业务事件", FarmDoorApp::sendEventsPage);
  Esp32BaseWeb::addPage("/calibration", "行程校准", FarmDoorApp::sendCalibrationPage);
  Esp32BaseWeb::addPage("/diagnostics", "自动门诊断", FarmDoorApp::sendDiagnosticsPage);
  Esp32BaseWeb::addApi("/api/app/status", FarmDoorApp::sendStatusJson);
  Esp32BaseWeb::addApi("/api/app/diagnostics", FarmDoorApp::sendDiagnosticsJson);
  Esp32BaseWeb::addApi("/api/app/events/recent", FarmDoorApp::sendRecentEventsJson);
  Esp32BaseWeb::addApi("/api/app/records", FarmDoorApp::sendRecordsJson);
  Esp32BaseWeb::addApi("/api/app/door/open", FarmDoorApp::handleDoorOpen);
  Esp32BaseWeb::addApi("/api/app/door/close", FarmDoorApp::handleDoorClose);
  Esp32BaseWeb::addApi("/api/app/door/stop", FarmDoorApp::handleDoorStop);
  Esp32BaseWeb::addApi("/api/app/maintenance/set-position", FarmDoorApp::handleSetPosition);
  Esp32BaseWeb::addApi("/api/app/maintenance/set-travel", FarmDoorApp::handleSetTravel);
  Esp32BaseWeb::addApi("/api/app/maintenance/adjust-travel", FarmDoorApp::handleAdjustTravel);
  Esp32BaseWeb::addApi("/api/app/maintenance/clear-fault", FarmDoorApp::handleClearFault);
#endif
}

void FarmDoorApp::sendHomePage() {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  char positionValue[32];
  char targetValue[32];
  char percentValue[16];
  char maxRunValue[32];
  formatInt64WithUnit(positionValue, sizeof(positionValue), snapshot.positionPulses, "脉冲");
  formatInt64WithUnit(targetValue, sizeof(targetValue), snapshot.openTargetPulses, "脉冲");
  formatPercent(percentValue, sizeof(percentValue), positionPercent(snapshot));
  formatInt64WithUnit(maxRunValue, sizeof(maxRunValue), g_doorConfig.maxRunPulses, "脉冲");

  Esp32BaseWeb::sendHeader("自动门首页");
  Esp32BaseWeb::sendPageTitle("自动门首页", "鸡舍自动门状态和操作");

  Esp32BaseWeb::beginPanel("门状态");
  sendDoorStatusTable(snapshot, positionValue, targetValue, percentValue, maxRunValue);
  sendDoorActionButtons(snapshot);
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendRecordsPage() {
#if ESP32BASE_ENABLE_WEB
  PageParams params;
  bool valid = readPageParams(15, 15, params);
  uint32_t startIndex = 0;
  valid = valid && pageStartIndex(params, startIndex);

  DoorRecordQuery query;
  query.startIndex = startIndex;
  query.limit = static_cast<uint8_t>(params.per);

  Esp32BaseWeb::sendHeader("开关门记录");
  Esp32BaseWeb::sendPageTitle("开关门记录", "分页查看自动门操作、校准和维护记录");

  if (!valid) {
    Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                             "参数无效",
                             "请检查页码或每页数量。");
  }

  Esp32BaseWeb::beginPanel("记录列表");
  Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'>");
  Esp32BaseWeb::sendChunk("<tr><th>序号</th><th>时间</th><th>事件类型</th><th>命令</th><th>结果</th><th>位置变化</th><th>行程变化</th></tr>");

  uint32_t totalRecords = 0;
  uint8_t emitted = 0;
  if (valid) {
#if ESP32BASE_ENABLE_FS
    char recordPath[96];
    DoorRecordPage page;
    const bool hasPath = doorRecordPathForArchive(0, recordPath, sizeof(recordPath));
    const DoorRecordReadResult readResult =
        hasPath ? readDoorRecordPage(recordPath,
                                     query,
                                     doorRecordFileSize,
                                     readDoorRecordBytesAt,
                                     nullptr,
                                     page)
                : DoorRecordReadResult::InvalidArgument;
    if (readResult == DoorRecordReadResult::Ok) {
      totalRecords = page.totalRecords;
      for (uint8_t i = 0; i < page.count; ++i) {
        sendRecordHtmlRow(page.records[i]);
        ++emitted;
      }
    }
    if (readResult != DoorRecordReadResult::Ok)
#endif
    {
      const DoorRecordSnapshot snapshot = g_records.snapshot();
      totalRecords = snapshot.count;
      for (uint8_t i = 0; i < snapshot.count; ++i) {
        if (i < startIndex || emitted >= params.per) {
          continue;
        }
        const DoorRecord& record = snapshot.records[i];
        sendRecordHtmlRow(record);
        ++emitted;
      }
    }
  }
  if (emitted == 0) {
    Esp32BaseWeb::sendChunk("<tr><td colspan='7'>暂无记录</td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></div>");
  Esp32BaseWeb::Pagination recordPagination = {"/records", nullptr, params.page, params.per, totalRecords};
  Esp32BaseWeb::sendPagination(recordPagination);
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendEventsPage() {
#if ESP32BASE_ENABLE_WEB
  PageParams params;
  bool valid = readPageParams(20, 50, params);
  uint32_t startIndex = 0;
  valid = valid && pageStartIndex(params, startIndex) && startIndex <= UINT16_MAX;

  Esp32BaseWeb::sendHeader("业务事件");
  Esp32BaseWeb::sendPageTitle("业务事件", "分页查看维护、保护和存储告警事件");

  if (!FarmAutoEventLog::isReady()) {
    Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                             "业务事件存储未就绪",
                             FarmAutoEventLog::lastError());
  }
  if (!valid) {
    Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                             "参数无效",
                             "请检查页码或每页数量。");
  }

  Esp32BaseWeb::beginPanel("事件列表");
  Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'>");
  Esp32BaseWeb::sendChunk("<tr><th>ID</th><th>时间</th><th>级别</th><th>领域</th><th>动作</th><th>目标</th><th>消息</th><th>详情</th></tr>");

  BusinessEventTableState state;
  bool readOk = false;
  if (valid) {
    readOk = FarmAutoEventLog::readLatest(static_cast<uint16_t>(startIndex),
                                          static_cast<uint16_t>(params.per),
                                          sendBusinessEventHtmlCallback,
                                          &state);
  }
  if (state.emitted == 0) {
    Esp32BaseWeb::sendChunk("<tr><td colspan='8'>暂无事件</td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></div>");
  if (valid && !readOk) {
    Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                             "业务事件读取失败",
                             FarmAutoEventLog::lastError());
  }
  Esp32BaseWeb::Pagination eventPagination = {"/events", nullptr, params.page, params.per, FarmAutoEventLog::count()};
  Esp32BaseWeb::sendPagination(eventPagination);
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendCalibrationPage() {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  char positionValue[32];
  char targetValue[32];
  char pulsesPerRevValue[32];
  char turnsValue[32];
  const int64_t turnsX100 = turnsX100FromOpenTargetPulses(snapshot.openTargetPulses);
  formatInt64WithUnit(positionValue, sizeof(positionValue), snapshot.positionPulses, "脉冲");
  formatInt64WithUnit(targetValue, sizeof(targetValue), snapshot.openTargetPulses, "脉冲");
  formatInt64(pulsesPerRevValue, sizeof(pulsesPerRevValue), g_motorKinematics.outputPulsesPerRev);
  snprintf(turnsValue,
           sizeof(turnsValue),
           "%lld.%02lld 圈",
           static_cast<long long>(turnsX100 / 100),
           static_cast<long long>(llabs(turnsX100 % 100)));

  Esp32BaseWeb::sendHeader("行程校准");
  Esp32BaseWeb::sendPageTitle("校准", "标定当前位置、开门目标和行程微调");

  Esp32BaseWeb::beginPanel("当前位置");
  sendCalibrationStatusTable(snapshot, positionValue, targetValue, turnsValue, pulsesPerRevValue);
  Esp32BaseWeb::endPanel();

