tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
  Esp32BaseWeb::beginPanel("端点标定");
  sendCalibrationActionForm("关门基准",
                            "当前编码器位置会被保存为 0，后续关门以此为目标。",
                            "/api/app/maintenance/set-position",
                            "把当前位置标为关门基准？",
                            "position",
                            "closed",
                            "标为关门",
                            "danger");
  sendCalibrationActionForm("开门位置",
                            "当前编码器位置会被保存为开门目标。",
                            "/api/app/maintenance/set-position",
                            "把当前位置标为开门位置？",
                            "position",
                            "open",
                            "标为开门",
                            "danger");
  Esp32BaseWeb::endPanel();

  Esp32BaseWeb::beginPanel("行程校准");
  Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/app/maintenance/set-travel' onsubmit=\"return confirm('设置新的开门目标？')&&once(this)\">");
  Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='travel-turns'>开门目标</label><input id='travel-turns' name='openTurnsX100' type='number' min='1' max='2000' value='");
  char turnsInput[16];
  snprintf(turnsInput, sizeof(turnsInput), "%lld", static_cast<long long>(turnsX100));
  Esp32BaseWeb::sendChunk(turnsInput);
  Esp32BaseWeb::sendChunk("'><small>单位为 0.01 圈，例如 500 表示 5 圈。</small></div>");
  Esp32BaseWeb::sendChunk("</div><div class='actions'><input class='btnlink warn' type='submit' value='保存开门目标'></div></form>");
  Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/app/maintenance/adjust-travel' onsubmit=\"return confirm('微调开门目标？')&&once(this)\">");
  Esp32BaseWeb::sendChunk("<div class='fieldgrid'>");
  Esp32BaseWeb::sendChunk("<div class='field med'><label for='adjust-delta'>微调量</label><input id='adjust-delta' name='deltaTurnsX100' type='number' value='5'><small>单位为 0.01 圈，可为负数。</small></div>");
  Esp32BaseWeb::sendChunk("</div><div class='actions'><input class='btnlink warn' type='submit' value='应用微调'></div></form>");
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendDiagnosticsPage() {
#if ESP32BASE_ENABLE_WEB
  char at24cValue[16];
  char currentValue[32];
  const FarmDoorReadOnlyDiagnostics diagnostics = FarmDoorHw.readDiagnostics();
  snprintf(at24cValue, sizeof(at24cValue), "%s", diagnostics.at24cOnline ? "在线" : "离线");
  snprintf(currentValue, sizeof(currentValue), "%d ADC", diagnostics.currentRawAdc);

  Esp32BaseWeb::sendHeader("自动门诊断");
  Esp32BaseWeb::sendPageTitle("诊断", "只读硬件状态");

  Esp32BaseWeb::beginPanel("硬件状态");
  sendDiagnosticsStatusTable(diagnostics, at24cValue, currentValue);
  Esp32BaseWeb::endPanel();
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendStatusJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const DoorSnapshot snapshot = g_door.snapshot();
  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"appKind\":\"FarmDoor\",");
  Esp32BaseWeb::sendChunk("\"firmware\":\"");
  Esp32BaseWeb::writeJsonEscaped(Esp32Base::firmwareVersion());
  Esp32BaseWeb::sendChunk("\",\"schemaVersion\":1,");
  Esp32BaseWeb::sendChunk("\"state\":\"");
  Esp32BaseWeb::sendChunk(stateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"activeCommand\":\"");
  Esp32BaseWeb::sendChunk(commandName(snapshot.activeCommand));
  Esp32BaseWeb::sendChunk("\",\"position\":{\"pulses\":");
  sendInt64(snapshot.positionPulses);
  Esp32BaseWeb::sendChunk(",\"percent\":");
  sendUint32(positionPercent(snapshot));
  Esp32BaseWeb::sendChunk(",\"trustLevel\":\"");
  Esp32BaseWeb::sendChunk(trustName(snapshot.positionTrustLevel));
  Esp32BaseWeb::sendChunk("\",\"source\":\"");
  Esp32BaseWeb::sendChunk(snapshot.positionTrustLevel == PositionTrustLevel::Untrusted ? "NotCalibrated" : "Runtime");
  Esp32BaseWeb::sendChunk("\"},\"travel\":{\"closedPulses\":");
  sendInt64(snapshot.closedPositionPulses);
  Esp32BaseWeb::sendChunk(",\"openTargetPulses\":");
  sendInt64(snapshot.openTargetPulses);
  Esp32BaseWeb::sendChunk(",\"outputPulsesPerRev\":");
  sendInt64(kDefaultOutputPulsesPerRev);
  Esp32BaseWeb::sendChunk(",\"maxRunPulses\":");
  sendInt64(g_doorConfig.maxRunPulses);
  Esp32BaseWeb::sendChunk(",\"maxRunMs\":");
  sendUint32(g_doorConfig.maxRunMs);
  Esp32BaseWeb::sendChunk("},\"lastStopReason\":\"");
  Esp32BaseWeb::sendChunk(stopReasonName(snapshot.lastStopReason));
  Esp32BaseWeb::sendChunk("\",\"faultReason\":\"");
  Esp32BaseWeb::sendChunk(faultReasonName(snapshot.faultReason));
  Esp32BaseWeb::sendChunk("\",\"recentCommand\":");
  sendRecentCommandJson();
  Esp32BaseWeb::sendChunk(",");
  Esp32BaseWeb::sendChunk("\"currentSensor\":{\"chip\":\"INA240A2\",\"adcPin\":33,\"enabled\":");
  Esp32BaseWeb::sendChunk(g_currentGuard.enabled ? "true" : "false");
  Esp32BaseWeb::sendChunk("},\"motor\":{\"driver\":\"AT8236\",\"encoderMode\":\"X1\"},");
  sendMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmDoorApp::sendDiagnosticsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const FarmDoorReadOnlyDiagnostics diagnostics = FarmDoorHw.readDiagnostics();

  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"appKind\":\"FarmDoor\",");
  Esp32BaseWeb::sendChunk("\"mode\":\"readOnlyDiagnostics\",");
  Esp32BaseWeb::sendChunk("\"buttons\":{");
  sendDigitalField("aux", diagnostics.buttonAux);
  Esp32BaseWeb::sendChunk(",");
  sendDigitalField("open", diagnostics.buttonOpen);
  Esp32BaseWeb::sendChunk(",");
  sendDigitalField("close", diagnostics.buttonClose);
  Esp32BaseWeb::sendChunk(",");
  sendDigitalField("stop", diagnostics.buttonStop);
  Esp32BaseWeb::sendChunk("},\"encoder\":{");
  sendDigitalField("a", diagnostics.encoderA);
  Esp32BaseWeb::sendChunk(",");
  sendDigitalField("b", diagnostics.encoderB);
  Esp32BaseWeb::sendChunk("},\"currentSensor\":{\"chip\":\"INA240A2\",\"adcPin\":33,\"rawAdc\":");
  char number[16];
  snprintf(number, sizeof(number), "%d", diagnostics.currentRawAdc);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"rawMin\":");
  snprintf(number, sizeof(number), "%d", diagnostics.currentRawMin);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"rawMax\":");
  snprintf(number, sizeof(number), "%d", diagnostics.currentRawMax);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"rawAvg\":");
  snprintf(number, sizeof(number), "%d", diagnostics.currentRawAvg);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"sampleCount\":");
  snprintf(number, sizeof(number), "%u", diagnostics.currentSampleCount);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"compileEnabled\":");
#if FARMAUTO_FARMDOOR_ENABLE_INA240A2
  Esp32BaseWeb::sendChunk("true");
#else
  Esp32BaseWeb::sendChunk("false");
#endif
  Esp32BaseWeb::sendChunk(",\"runtimeEnabled\":");
  Esp32BaseWeb::sendChunk(boolJson(g_currentGuard.enabled));
  Esp32BaseWeb::sendChunk("},\"at24c\":{\"address\":\"0x50\",\"online\":");
  Esp32BaseWeb::sendChunk(boolJson(diagnostics.at24cOnline));
  Esp32BaseWeb::sendChunk(",\"storeReady\":");
  Esp32BaseWeb::sendChunk(boolJson(g_at24cStoreReady));
  Esp32BaseWeb::sendChunk("},");
  sendMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmDoorApp::sendRecentEventsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint32_t limitParam = 32;
  uint32_t offsetParam = 0;
  if (!readUint32ParamOptional("limit", limitParam) ||
      !readUint32ParamOptional("start", offsetParam) ||
      limitParam == 0 || limitParam > 100 || offsetParam > UINT16_MAX) {
    beginRawJson(400);
    Esp32BaseWeb::sendChunk("{\"ok\":false,\"error\":\"InvalidArgument\"}");
    endRawJson();
    return;
  }
  BusinessEventJsonState state;
  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"store\":\"app_events\",\"ready\":");
  Esp32BaseWeb::sendChunk(boolJson(FarmAutoEventLog::isReady()));
  Esp32BaseWeb::sendChunk(",\"faulted\":");
  Esp32BaseWeb::sendChunk(boolJson(FarmAutoEventLog::faulted()));
  Esp32BaseWeb::sendChunk(",\"count\":");
  sendUint32(FarmAutoEventLog::count());
  Esp32BaseWeb::sendChunk(",\"capacity\":");
  sendUint32(FarmAutoEventLog::capacity());
  Esp32BaseWeb::sendChunk(",\"events\":[");
  const bool readOk = FarmAutoEventLog::readLatest(static_cast<uint16_t>(offsetParam),
                                                   static_cast<uint16_t>(limitParam),
                                                   sendBusinessEventJsonCallback,
                                                   &state);
  Esp32BaseWeb::sendChunk("],\"readOk\":");
  Esp32BaseWeb::sendChunk(boolJson(readOk));
  Esp32BaseWeb::sendChunk(",\"returned\":");
  sendUint32(state.emitted);
  Esp32BaseWeb::sendChunk(",\"lastError\":\"");
  Esp32BaseWeb::writeJsonEscaped(FarmAutoEventLog::lastError());
  Esp32BaseWeb::sendChunk("\"}");
  endRawJson();
#endif
}

void FarmDoorApp::sendRecordsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  DoorRecordQuery query;
  uint32_t limitParam = query.limit;
  if (!readUint32ParamOptional("start", query.startIndex) ||
      !readUint32ParamOptional("limit", limitParam) ||
      !readUint32ParamOptional("startUnixTime", query.startUnixTime) ||
      !readUint32ParamOptional("endUnixTime", query.endUnixTime) || limitParam == 0 ||
      limitParam > kDoorRecordPageMaxRecords) {
    sendCommandResultJson(DoorCommandResult::InvalidArgument);
    return;
  }
  query.limit = static_cast<uint8_t>(limitParam);
  char eventType[32];
  if (Esp32BaseWeb::getParam("eventType", eventType, sizeof(eventType)) && eventType[0] != '\0') {
    if (!doorRecordTypeFromName(eventType, query.type)) {
      sendCommandResultJson(DoorCommandResult::InvalidArgument);
      return;
    }
    query.typeFilterEnabled = true;
  }
  uint32_t archiveIndex = 0;
  if (!readUint32ParamOptional("archive", archiveIndex) || archiveIndex > kDoorRecordMaxArchives) {
    sendCommandResultJson(DoorCommandResult::InvalidArgument);
    return;
  }

  beginRawJson(200);
#if ESP32BASE_ENABLE_FS
  char recordPath[96];
  if (!doorRecordPathForArchive(archiveIndex, recordPath, sizeof(recordPath))) {
    sendCommandResultJson(DoorCommandResult::InvalidArgument);
    return;
  }
  DoorRecordPage page;
  const DoorRecordReadResult readResult = readDoorRecordPage(recordPath,
                                                             query,
                                                             doorRecordFileSize,
                                                             readDoorRecordBytesAt,
                                                             nullptr,
                                                             page);
  if (readResult == DoorRecordReadResult::Ok && page.totalRecords > 0) {
    Esp32BaseWeb::sendChunk("{\"source\":\"flash\",\"start\":");
    sendUint32(page.startIndex);
    Esp32BaseWeb::sendChunk(",\"archive\":");
    sendUint32(archiveIndex);
    Esp32BaseWeb::sendChunk(",\"nextIndex\":");
    sendUint32(page.nextIndex);
    Esp32BaseWeb::sendChunk(",\"limit\":");
    sendUint32(limitParam);
    Esp32BaseWeb::sendChunk(",\"count\":");
    sendUint32(page.count);
    Esp32BaseWeb::sendChunk(",\"totalRecords\":");
    sendUint32(page.totalRecords);
    Esp32BaseWeb::sendChunk(",\"recordBytes\":");
    sendUint32(kDoorRecordEncodedMaxBytes);
    Esp32BaseWeb::sendChunk(",\"records\":[");
    for (uint8_t i = 0; i < page.count; ++i) {
      if (i > 0) {
        Esp32BaseWeb::sendChunk(",");
      }
      sendRecordJson(page.records[i]);
    }
    Esp32BaseWeb::sendChunk("]}");
    endRawJson();
    return;
  }
  if (archiveIndex > 0) {
    Esp32BaseWeb::sendChunk("{\"source\":\"flash\",\"start\":0,\"archive\":");
    sendUint32(archiveIndex);
    Esp32BaseWeb::sendChunk(",\"nextIndex\":0,\"limit\":");
    sendUint32(limitParam);
    Esp32BaseWeb::sendChunk(",\"count\":0,\"totalRecords\":0,\"recordBytes\":");
    sendUint32(kDoorRecordEncodedMaxBytes);
    Esp32BaseWeb::sendChunk(",\"records\":[]}");
    endRawJson();
    return;
  }
#endif

  const DoorRecordSnapshot snapshot = g_records.snapshot();
  Esp32BaseWeb::sendChunk("{\"source\":\"ram\",\"start\":0,\"limit\":");
  sendUint32(kDoorRecentRecordCapacity);
  Esp32BaseWeb::sendChunk(",\"count\":");
  sendUint32(snapshot.count);
  Esp32BaseWeb::sendChunk(",\"totalRecords\":");
  sendUint32(snapshot.count);
  Esp32BaseWeb::sendChunk(",\"capacity\":");
  sendUint32(kDoorRecentRecordCapacity);
  Esp32BaseWeb::sendChunk(",\"records\":[");
  for (uint8_t i = 0; i < snapshot.count; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    sendRecordJson(snapshot.records[i]);
  }
  Esp32BaseWeb::sendChunk("]}");
  endRawJson();
#endif
}

void FarmDoorApp::handleDoorOpen() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const uint32_t commandId = allocateCommandId();
  DoorCommandResult result = g_door.requestOpen();
  if (result == DoorCommandResult::Ok) {
    result = startDoorMotorTo(g_door.snapshot().targetPulses);
  }
  DoorRecord record;
  record.commandId = commandId;
  record.type = DoorRecordType::CommandRequested;
  record.result = doorRecordResultFromCommand(result);
  record.command = DoorCommand::Open;
  record.newTravelPulses = g_door.snapshot().openTargetPulses;
  recordBusinessEvent(record);
  sendCommandResultJson(result, commandId);
#endif
}

void FarmDoorApp::handleDoorClose() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const uint32_t commandId = allocateCommandId();
  DoorCommandResult result = g_door.requestClose();
  if (result == DoorCommandResult::Ok) {
    result = startDoorMotorTo(g_door.snapshot().targetPulses);
  }
  DoorRecord record;
  record.commandId = commandId;
  record.type = DoorRecordType::CommandRequested;
  record.result = doorRecordResultFromCommand(result);
  record.command = DoorCommand::Close;
  recordBusinessEvent(record);
  sendCommandResultJson(result, commandId);
#endif
}

void FarmDoorApp::handleDoorStop() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const uint32_t commandId = allocateCommandId();
  const DoorSnapshot snapshot = g_door.snapshot();
  int64_t stoppedPosition = snapshot.positionPulses;
  if (g_motorOutputReady) {
    g_motor.requestStop();
    stoppedPosition = g_motor.snapshot().positionPulses;
  }
  const DoorCommandResult result = g_door.requestStop(stoppedPosition);
  DoorRecord record;
  record.commandId = commandId;
  record.type = DoorRecordType::CommandRequested;
  record.result = doorRecordResultFromCommand(result);
  record.command = DoorCommand::Stop;
  record.oldPositionPulses = snapshot.positionPulses;
  record.newPositionPulses = stoppedPosition;
  recordBusinessEvent(record);
  if (result == DoorCommandResult::Ok) {
    persistDoorRecoveryStateIfReady();
  }
  sendCommandResultJson(result, commandId);
#endif
}

